import React, { Component } from 'react';
import $ from "jquery";

export default class TicTacToeDoc extends Component {

  scrollToAnchor(name) {
    console.log(name);
    let target = 'h3[name="' + name + '"]'
    let offset = $(target).offset().top;
    $('body').animate({scrollTop: offset-20}, 500, 'swing');
  }
  render() {
    return(
      <div className="tictactoe-doc">
        <div className="container">
          <div className="row">
            <div className="index-area">
              <p>目次</p>
              <ul>
                <li><a onClick={() => this.scrollToAnchor("about")}>TicTacToeとは</a></li>
                <li><a onClick={() => this.scrollToAnchor("mechanism")}>通信の仕組み</a></li>
                <li><a onClick={() => this.scrollToAnchor("making")}>AIの作り方</a></li>
                <li><a onClick={() => this.scrollToAnchor("submit")}>AIの提出方法</a></li>
                <li><a onClick={() => this.scrollToAnchor("sample")}>AIサンプル</a></li>
              </ul>
            </div>
            <div className="contents-area">
              <h3 name="about">TicTacToeとは</h3>
              <p>
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト<br/>
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
              </p>
              <h3 name="mechanism">通信の仕組み</h3>
              <p>
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト<br/>
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
              </p>
              <h3 name="making">AIの作り方</h3>
              <p>
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト<br/>
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
              </p>
              <h3 name="submit">AIの提出方法</h3>
              <p>
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト<br/>
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
                テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト
              </p>
              <h3 name="sample">AIサンプル集</h3>
              <ul>
                <li>サンプル1</li>
                <li>サンプル2</li>
                <li>サンプル3</li>
                <li>サンプル4</li>
              </ul>
            </div>
          </div>
        </div>
      </div>
    )
  }
}
